#include <stdio.h> 

void main(void){
static float a[6][5] = {{3, 5, 6},
                        {2, 1, 4},
                        {8, 7, 1},
                        {3, 5, 4}};

int i, j;
for (i = 0; i < 4; i++){
    for (j = 0; j < 3; j++){
        a[i][3] += a[i][j];       // i번째 행의 합
        a[4][j] += a[i][j];       // j번째 열의 합
        a[4][3] += a[i][j];       // 총합
        a[i][4] = a[i][3] / 3;    // 행평균
        a[5][j] = a[4][j] / 4;    // 열평균    
        }
    }
    for ( j = 0; j < 3; j++){
        a[5][4] += a[5][j] / 3;      // 총평균
    }
    
for (i = 0; i < 6; i++){         // 배열원소 출력
        if (i == 4)
            printf("---------------------------------------\n");
        for (j = 0; j < 5; j++){
            if (j == 3)
                printf(" | ");
                printf(" %6.1f", a[i][j]);
            }
        printf("\n");
    }
}